Ran Plan for dir: `google-cloud-platform/google-service-accounts/modules/mv-auxiliary` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.auxiliary.data.template_file.keys[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "keys"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "${key}"
      + vars     = {
          + "key" = (known after apply)
        }
    }

  # module.auxiliary.google_project_iam_member.project-roles[0] will be created
+ resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "mv-auxiliary"
      + role    = "roles/viewer"
    }

  # module.auxiliary.google_service_account.service_accounts[0] will be created
+ resource "google_service_account" "service_accounts" {
      + account_id   = "temporary"
      + display_name = "Terraform-managed service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "mv-auxiliary"
      + unique_id    = (known after apply)
    }

  # module.auxiliary.google_service_account_key.keys[0] will be created
+ resource "google_service_account_key" "keys" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = "keybase:"
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # module.mindvalley.data.template_file.keys[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "keys"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "${key}"
      + vars     = {
          + "key" = (known after apply)
        }
    }

  # module.mindvalley.google_project_iam_member.project-roles[0] will be created
+ resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "mv-auxiliary"
      + role    = "roles/viewer"
    }

  # module.mindvalley.google_service_account.service_accounts[0] will be created
+ resource "google_service_account" "service_accounts" {
      + account_id   = "mindvalley"
      + display_name = "Terraform-managed service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "mv-auxiliary"
      + unique_id    = (known after apply)
    }

  # module.mindvalley.google_service_account_key.keys[0] will be created
+ resource "google_service_account_key" "keys" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = "keybase:"
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # module.terraform.data.template_file.keys[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "keys"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "${key}"
      + vars     = {
          + "key" = (known after apply)
        }
    }

  # module.terraform.google_project_iam_member.project-roles[0] will be created
+ resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "mv-auxiliary"
      + role    = "roles/viewer"
    }

  # module.terraform.google_service_account.service_accounts[0] will be created
+ resource "google_service_account" "service_accounts" {
      + account_id   = "terraform"
      + display_name = "Terraform-managed service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "mv-auxiliary"
      + unique_id    = (known after apply)
    }

  # module.terraform.google_service_account_key.keys[0] will be created
+ resource "google_service_account_key" "keys" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = "keybase:naiduarvind"
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d google-cloud-platform/google-service-accounts/modules/mv-auxiliary`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-5976d75b96-lts8s:4141/lock?id=mindvalley%252Fauxiliary%252Fgoogle-cloud-platform%252Fgoogle-service-accounts%252Fmodules%252Fmv-auxiliary%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d google-cloud-platform/google-service-accounts/modules/mv-auxiliary -- -var project_id=mv-auxiliary -var keybase_username=naiduarvind`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
